# PrimitiveType Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCData..::..PrimitiveType Property
IFCData Class See Also
---
The primitive data type.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public IFCDataPrimitiveType PrimitiveType { get; set; }
```

Visual Basic
---
```text
Public Property PrimitiveType As IFCDataPrimitiveType
	Get
	Set
```

Visual C++
---
```text
public:
property IFCDataPrimitiveType PrimitiveType {
	IFCDataPrimitiveType get ();
	void set (IFCDataPrimitiveType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
IFCData Class
Autodesk.Revit.DB.IFC Namespace